EDT/УТ/src/Documents/ФиксацияИзмененияПолигоновОпределенияСмен/ФиксацияИзмененияПолигоновОпределенияСмен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ФиксацияИзмененияПолигоновОпределенияСмен</name>
  <registerRecords>InformationRegister.ПолигоныОпределенияСменыМаршрутизации</registerRecords>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРейсов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АктивнаяСхемаПолигональнойМаршрутизации</name>
    <type>
      <types>CatalogRef.СхемыПолигональнойМаршрутизации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ГруппыПолигонов</name>
    <attributes>
      <name>ГруппаПолигонов</name>
      <type>
        <types>CatalogRef.ГруппыПолигоновМаршрутизации</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаПолигоновУчитывается</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Полигоны</name>
    <attributes>
      <name>ГруппаПолигонов</name>
      <type>
        <types>CatalogRef.ГруппыПолигоновМаршрутизации</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерПолигонаМаршрутизации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолигонУчитывается</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/ПолигоныОпределенияСменыМаршрутизации/ПолигоныОпределенияСменыМаршрутизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПолигоныОпределенияСменыМаршрутизации</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПолигонУчитывается</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Смена</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРейсов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ГруппаПолигоновМаршрутизации</name>
    <type>
      <types>CatalogRef.ГруппыПолигоновМаршрутизации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерПолигонаМаршрутизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/ДополнительныеПараметрыЗаказа/ДополнительныеПараметрыЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДополнительныеПараметрыЗаказа</name>
  <resources>
    <name>ОценочнаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОплатеКлиентом</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СкладМагазина</name>
    <type>
      <types>CatalogRef.СкладыМагазинов</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаОтклоненияЗаказа</name>
    <type>
      <types>CatalogRef.ПричиныОтклоненияЗаказаВСистеме</types>
    </type>
  </resources>
  <resources>
    <name>ЧастичныйВыкупЗапрещен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СОжиданием</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КОплатеКлиентомИзмененное</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>okey</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ШтрихкодOZON</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>nameOZON</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВозвратЗапрещен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПодъемОплачен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РасстояниеОтБазыПоДорогам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КатегорияДляРасчетаЗП</name>
    <type>
      <types>CatalogRef.КатегорииДоставки2014</types>
    </type>
  </resources>
  <resources>
    <name>ПравилоСопоставленияКатегории</name>
    <type>
      <types>CatalogRef.ПравилаСопоставленияКатегорийЗаказовДляРасчетаЗП</types>
    </type>
  </resources>
  <resources>
    <name>ПредварительноеЗакрытие</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДополнительныйНомерЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТарифицируемыйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтавкаНДСФЗПоДоставке</name>
    <type>
      <types>CatalogRef.СтавкиНДСФЗ54</types>
    </type>
  </resources>
  <resources>
    <name>EmailКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>МетодОплатыПодъемаЗаказа</name>
    <type>
      <types>EnumRef.МетодыОплатыПодъёмаЗаказа</types>
    </type>
  </resources>
  <resources>
    <name>ТарифнаяСеткаПодъемаЗаказов</name>
    <type>
      <types>CatalogRef.ТарифыПодъемаЗаказовНаЭтаж</types>
    </type>
  </resources>
  <resources>
    <name>КатегорияДляРасчетаЗП_Миго</name>
    <type>
      <types>CatalogRef.мгКатегорииЗаказов</types>
    </type>
  </resources>
  <resources>
    <name>СхемаЛогистическихБрейков</name>
    <type>
      <types>CatalogRef.СхемыЛогистическихБрейков</types>
    </type>
  </resources>
  <resources>
    <name>ЛогистическийБрейк</name>
    <type>
      <types>CatalogRef.ЛогистическиеБрейки</types>
    </type>
  </resources>
  <resources>
    <name>Доставка</name>
    <type>
      <types>BusinessProcessRef.новаМестнаяДоставка</types>
    </type>
  </resources>
  <resources>
    <name>Смена</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </resources>
  <resources>
    <name>Широта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>13</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Долгота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>13</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодИдентификацииКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПолучательЗаказа</name>
    <type>
      <types>CatalogRef.ПолучателиЗаказов</types>
    </type>
  </resources>
  <resources>
    <name>ТребуетсяПредъявлениеУдостоверяющегоДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТарифРасчетаСтоимостиДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НегабаритныйЗаказ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПодписаниеИВозвратСопрДокументов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВнешнийОператорМаршрутизации</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>Агрегатор</name>
    <type>
      <types>CatalogRef.Маркетплейсы</types>
    </type>
  </resources>
  <resources>
    <name>ТарификацияПоОбъемномуВесу</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТарифицируемыйОбъемныйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПунктПВЗ</name>
    <type>
      <types>CatalogRef.ПунктыПВЗ</types>
    </type>
  </resources>
  <resources>
    <name>УровеньОбслуживанияЗаказа</name>
    <type>
      <types>EnumRef.УровниОбслуживания</types>
    </type>
  </resources>
  <resources>
    <name>СсылкаНаОтслеживание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаСозданияЗаказа</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ГабаритнаяХарактеристикаОпределенияЛогБрейка</name>
    <type>
      <types>EnumRef.ГабаритныеХарактеристикиЗаказа</types>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Catalogs/ГруппыПолигоновМаршрутизации/ГруппыПолигоновМаршрутизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыПолигоновМаршрутизации</name>
  <attributes>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПолигоныМаршрутизации</name>
    <attributes>
      <name>НомерПолигона</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/УТ/src/Documents/ФиксацияИзмененияПолигоновОпределенияСмен/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ПолигоныОпределенияСменыМаршрутизации.Записывать = Истина;
	Движения.ПолигоныОпределенияСменыМаршрутизации.Очистить();
	
	Для Каждого СтрокаПолигона Из Полигоны Цикл	
		
		Движение = Движения.ПолигоныОпределенияСменыМаршрутизации.Добавить();
		Движение.Регистратор = ЭтотОбъект.ссылка;
		Движение.Период = ЭтотОбъект.Дата;
		ЗаполнитьЗначенияСвойств(Движение, ЭтотОбъект);
		
		Движение.ГруппаПолигоновМаршрутизации = СтрокаПолигона.ГруппаПолигонов; 
		Движение.НомерПолигонаМаршрутизации = СтрокаПолигона.НомерПолигонаМаршрутизации;
		Движение.ПолигонУчитывается = СтрокаПолигона.ПолигонУчитывается;
		
	КонецЦикла;

	//Движения.Записать();
	
	//ОбработатьСменыЗаказов();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;	
	
	МассивУдаляемыхСтрокПолигонов = Новый Массив;
	
	Для Каждого СтрокаПолигонов Из Полигоны Цикл
		
		Если СтрокаПолигонов.ГруппаПолигонов = Справочники.ГруппыПолигоновМаршрутизации.ПустаяСсылка() тогда
			Продолжить;
		КонецЕсли;	
		                                
		ГруппаПолигонов = ГруппыПолигонов.Найти(СтрокаПолигонов.ГруппаПолигонов, "ГруппаПолигонов");
		
		Если ГруппаПолигонов = Неопределено тогда
			
			МассивУдаляемыхСтрокПолигонов.Добавить(СтрокаПолигонов);
			
		КонецЕсли;	
		
	КонецЦикла;	
	
	Для Каждого СтрокаУдаляемыхПолигонов Из МассивУдаляемыхСтрокПолигонов Цикл
		
		Полигоны.Удалить(СтрокаУдаляемыхПолигонов);
		
	КонецЦикла;	
	
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьСменыЗаказов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
		|		ПО РеализацияТоваровУслуг.Ссылка = ДополнительныеПараметрыЗаказа.Заказ
		|ГДЕ
		|	РеализацияТоваровУслуг.ТерминалДоставки = &ТерминалДоставки
		|	И РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНач И &ДатаКон
		|	И НЕ ДополнительныеПараметрыЗаказа.Доставка = ЗНАЧЕНИЕ(БизнесПроцесс.новаМестнаяДоставка.ПустаяСсылка)";
	
	//Запрос.УстановитьПараметр("ДатаРейсов", ДатаРейсов);
	Запрос.УстановитьПараметр("ТерминалДоставки", Регион);
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ДатаРейсов));
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДатаРейсов));
	// меняем на интервал, обрабатываем только заданную дату, Марочкин, 18.03.2020
	
	МассивЗаказов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	//МаршрутизацияЗаказовСервер.УстановкаСменыДляЗаказов(МассивЗаказов);
	//CeHbKA #3301 18.03.2020
	МаршрутизацияЗаказовСервер.УстановкаСменыДляЗаказов_Новая(МассивЗаказов);
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьТабличныеЧастиДокумента(Док)  Экспорт
	
	Док.ГруппыПолигонов.Очистить();
	Док.Полигоны.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПолигоныОпределенияСменыМаршрутизацииСрезПоследних.Период КАК Период,
		|	ПолигоныОпределенияСменыМаршрутизацииСрезПоследних.ГруппаПолигоновМаршрутизации КАК ГруппаПолигоновМаршрутизации,
		|	ПолигоныОпределенияСменыМаршрутизацииСрезПоследних.НомерПолигонаМаршрутизации КАК НомерПолигонаМаршрутизации,
		|	ПолигоныОпределенияСменыМаршрутизацииСрезПоследних.ПолигонУчитывается КАК ПолигонУчитывается
		|ПОМЕСТИТЬ ВТ_ПервичныйСрез
		|ИЗ
		|	РегистрСведений.ПолигоныОпределенияСменыМаршрутизации.СрезПоследних(
		|			,
		|			ДатаРейсов <= &ДатаРейсов
		|				И Смена = &Смена
		|				И Регион = &Терминал) КАК ПолигоныОпределенияСменыМаршрутизацииСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПервичныйСрез.ГруппаПолигоновМаршрутизации КАК ГруппаПолигоновМаршрутизации,
		|	ВТ_ПервичныйСрез.НомерПолигонаМаршрутизации КАК НомерПолигонаМаршрутизации,
		|	ВТ_ПервичныйСрез.ПолигонУчитывается КАК ПолигонУчитывается
		|ПОМЕСТИТЬ ВТ_Срез
		|ИЗ
		|	ВТ_ПервичныйСрез КАК ВТ_ПервичныйСрез
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПервичныйСрез КАК ВТ_ПервичныйСрез1
		|		ПО ВТ_ПервичныйСрез.ГруппаПолигоновМаршрутизации = ВТ_ПервичныйСрез1.ГруппаПолигоновМаршрутизации
		|			И ВТ_ПервичныйСрез.НомерПолигонаМаршрутизации = ВТ_ПервичныйСрез1.НомерПолигонаМаршрутизации
		|			И (ВТ_ПервичныйСрез1.Период > ВТ_ПервичныйСрез.Период)
		|ГДЕ
		|	ВТ_ПервичныйСрез1.Период ЕСТЬ NULL
		|	И ВТ_ПервичныйСрез.ПолигонУчитывается
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ГруппыПолигоновМаршрутизацииПолигоныМаршрутизации.Ссылка КАК ГруппаПолигонов,
		|	ГруппыПолигоновМаршрутизацииПолигоныМаршрутизации.НомерПолигона КАК НомерПолигонаМаршрутизации,
		|	ЕСТЬNULL(ВТ_Срез.ПолигонУчитывается, ЛОЖЬ) КАК ПолигонУчитывается
		|ПОМЕСТИТЬ ВТ_Итог
		|ИЗ
		|	Справочник.ГруппыПолигоновМаршрутизации.ПолигоныМаршрутизации КАК ГруппыПолигоновМаршрутизацииПолигоныМаршрутизации
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Срез КАК ВТ_Срез
		|		ПО ГруппыПолигоновМаршрутизацииПолигоныМаршрутизации.Ссылка = ВТ_Срез.ГруппаПолигоновМаршрутизации
		|			И ГруппыПолигоновМаршрутизацииПолигоныМаршрутизации.НомерПолигона = ВТ_Срез.НомерПолигонаМаршрутизации
		|ГДЕ
		|	ГруппыПолигоновМаршрутизацииПолигоныМаршрутизации.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТ_Срез.ГруппаПолигоновМаршрутизации
		|			ИЗ
		|				ВТ_Срез)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Итог.ГруппаПолигонов КАК ГруппаПолигонов,
		|	ВТ_Итог.НомерПолигонаМаршрутизации КАК НомерПолигонаМаршрутизации,
		|	ВТ_Итог.ПолигонУчитывается КАК ПолигонУчитывается
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_Срез.ГруппаПолигоновМаршрутизации,
		|	ВТ_Срез.НомерПолигонаМаршрутизации,
		|	ВТ_Срез.ПолигонУчитывается
		|ИЗ
		|	ВТ_Срез КАК ВТ_Срез
		|ГДЕ
		|	НЕ ВТ_Срез.НомерПолигонаМаршрутизации В
		|				(ВЫБРАТЬ
		|					ВТ_Итог.НомерПолигонаМаршрутизации
		|				ИЗ
		|					ВТ_Итог)";
	
	Запрос.УстановитьПараметр("ДатаРейсов", Док.ДатаРейсов);
	Запрос.УстановитьПараметр("Смена", Док.Смена);
	Запрос.УстановитьПараметр("Терминал", Док.Регион);
	
	СписокПолигонов = Запрос.Выполнить().Выгрузить();
	СписокГрупп = СписокПолигонов.Скопировать(,"ГруппаПолигонов");
	СписокГрупп.Свернуть("ГруппаПолигонов");
	
	Для Каждого СтрокаГруппаМаршрутизации Из СписокГрупп Цикл
		
		ТекущийПолигонЗаполнения = СтрокаГруппаМаршрутизации.ГруппаПолигонов;
		
		Если Не ТекущийПолигонЗаполнения.Пустая() Тогда
			СтрокаГруппДокумента  = Док.ГруппыПолигонов.Добавить();
			СтрокаГруппДокумента.ГруппаПолигонов = ТекущийПолигонЗаполнения;
		КонецЕсли;
	
		СтрокиПолигонов = СписокПолигонов.НайтиСтроки(новый Структура("ГруппаПолигонов", ТекущийПолигонЗаполнения));
		
		Для Каждого СтрокаПолигона Из СтрокиПолигонов Цикл
			СтрокаПолигоновДокумента = Док.Полигоны.добавить();
			ЗаполнитьЗначенияСвойств(СтрокаПолигоновДокумента, СтрокаПолигона);
		КонецЦикла;	 
		
	КонецЦикла;
	
	УстановитьАктуальныеСостоянияГруппПолигонов(Док);
	
КонецПроцедуры	

&НаСервере
Процедура УстановитьАктуальныеСостоянияГруппПолигонов(Док) Экспорт
	
	Для Каждого СтрокаГруппаПолигонов Из Док.ГруппыПолигонов Цикл
		
		СтрокиПолигонов = Док.Полигоны.НайтиСтроки(Новый Структура("ГруппаПолигонов", СтрокаГруппаПолигонов.ГруппаПолигонов));
		СтрокиПолигоновИстина = Док.Полигоны.НайтиСтроки(Новый Структура("ГруппаПолигонов, ПолигонУчитывается", СтрокаГруппаПолигонов.ГруппаПолигонов, Истина));
		
		Если СтрокиПолигонов.Количество() = 0 Тогда
			СтрокаГруппаПолигонов.ГруппаПолигоновУчитывается = 0;
			Возврат;
		КонецЕсли;	
		
		Если  СтрокиПолигоновИстина.Количество() = 0 Тогда
			СтрокаГруппаПолигонов.ГруппаПолигоновУчитывается = 0;
		Иначе
			Если СтрокиПолигоновИстина.Количество() = СтрокиПолигонов.Количество() Тогда
				СтрокаГруппаПолигонов.ГруппаПолигоновУчитывается = 1;
			Иначе				
				СтрокаГруппаПолигонов.ГруппаПолигоновУчитывается = 2;
			Конецесли;
		Конецесли;
		
	КонецЦикла;	
	
Конецпроцедуры

&НаСервере
Процедура УстановитьАктуальныеСостоянияПолигонов(Док, ГруппаПолигонов, Состояние) экспорт
	
	СтрокиПолигонов = Док.Полигоны.НайтиСтроки(Новый Структура("ГруппаПолигонов", ГруппаПолигонов));
	Для Каждого СтрокаПолигона Из СтрокиПолигонов Цикл
		СтрокаПолигона.ПолигонУчитывается = Состояние;
	КонецЦикла;
	
КонецПроцедуры	

#КонецОбласти
